from django.conf import settings
from django.db import models


def type_category(): #вибірка категорій товару#
    category = [
        ('Торти на день народження', 'Торти на день народження'),
        ('Дитячі торти', 'Дитячі торти'),
        ('Весільні торти', 'Весільні торти'),
        ('Корпоративні торти', 'Корпоративні торти'),
        ('Кейк-попси', 'Кейк-попси'),
        ('Макаруни', 'Макаруни'),
    ]
    return category


def type_filling(): #вибірка категорій начинок#
    category = [
        ('Червоний оксамит із полуницею', 'Червоний оксамит із полуницею'),
        ('Манго-маракуйя', 'Манго-маракуйя'),
        ('Лавандовий', 'Лавандовий'),
        ('Карамельний', 'Карамельний'),
        ('Фісташковий з малиною', 'Фісташковий з малиною'),
        ('Подвійний шоколад з вишневим фламбе', 'Подвійний шоколад з вишневим фламбе'),
        ('Саусеп (макаруни)', 'Саусеп (макаруни)',),
        ('Полуниця-базилік (макаруни)', 'Полуниця-базилік (макаруни)'),
        ('Апельсин-розмарин (макаруни)', 'Апельсин-розмарин (макаруни)'),
        ('Солона карамель (макаруни)', 'Солона карамель (макаруни)'),
        ('Кава-кориця (макаруни)', 'Кава-кориця (макаруни)'),

    ]
    return category

class Purchase(models.Model): #модель для оформлення замовлення#
    ПІБ = models.CharField(max_length=100) #прізвище, ім'я замовника#
    Адреса = models.CharField(max_length=100) #адреса замовника#
    Телефон  = models.IntegerField() #телефон замовника#
    Назва_торта = models.CharField(max_length=100) #назва торта#
    Категорія = models.CharField(max_length=100, choices=type_category(), default='') #категорія торта#
    Начинка = models.CharField(max_length=100, choices=type_filling(), default='') #начика торта#
    Вага = models.CharField(max_length=100) #розмір торта#
    Побажання = models.TextField() #побажання#
    update = models.DateTimeField(auto_now=True) #дата оновлення замовлення#
    timestamp = models.DateTimeField(auto_now_add=True) #дата створення замовлення#


    def __str__(self):
        return self.ПІБ #повертає об'єкт по ПІБ#

    def page_purchase(self): #повертає сторінку для оформлення замовлення#
        return f'/purchase/'


